app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at", "icon") VALUES (?, ?, ?, ?)  [["name", "Health"], ["created_at", "2022-12-21 07:12:21.247560"], ["updated_at", "2022-12-21 07:12:21.247560"], ["icon", nil]]
---
  def create
    @category = current_user.categories.new(category_params)
    @category.user_id = current_user.id
    respond_to do |format|
      if @category.save

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Entretainment"], ["updated_at", "2022-12-20 14:34:58.391829"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @category.update(category_params)