app/controllers/expenses_controller.rb

  def index
    @expenses = Expense.all
---
SELECT "expenses".* FROM "expenses"

  def create
    @expense = current_user.expenses.new(expense_params)
    respond_to do |format|
      if @expense.save
---
INSERT INTO "expenses" ("title", "price", "created_at", "updated_at", "user_id", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Frozen Pizze"], ["price", "30.0"], ["created_at", "2022-12-26 22:04:10.992851"], ["updated_at", "2022-12-26 22:04:10.992851"], ["user_id", 1], ["category_id", 1]]

  def update
    respond_to do |format|
      if @expense.update(expense_params)
---
UPDATE "expenses" SET "title" = $1, "updated_at" = $2 WHERE "expenses"."id" = $3  [["title", "Frozen Pizza"], ["updated_at", "2022-12-26 22:04:23.636899"], ["id", 1]]

  def destroy
    @expense.destroy
---
DELETE FROM "expenses" WHERE "expenses"."id" = ?  [["id", 6]]

  def set_expense
    @expense = Expense.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]