app/views/categories/_category.html.erb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."category_id" = ?  [["category_id", 1]]
SELECT SUM("expenses"."price") FROM "expenses" WHERE "expenses"."category_id" = ?  [["category_id", 1]]
---
  <div class="bg-light border">Total Spent:</div>
  <div class="bg-light border ms-auto"><%= number_to_currency(category.expenses.sum(:price)) %>

SELECT "expenses".* FROM "expenses" WHERE "expenses"."category_id" = ?  [["category_id", 1]]
---

<% category.expenses.each do |expense| %>