app/views/categories/index.html.erb

  </div>
  <div class="ms-auto"><%= number_to_currency(category.expenses.sum(:price)) %></div>
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."category_id" = ?  [["category_id", 1]]
SELECT SUM("expenses"."price") FROM "expenses" WHERE "expenses"."category_id" = $1  [["category_id", 8]]